pascal-3.2/tutorials/surfaceTracking/newInterFreeFoam/capillarity2DoneFluid/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="newInterTrackFoam"

runApplication makeFaMesh
runApplication $application
